; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v1 - type_3 ?v7 - type_2)
 	      (pred_2 ?v4 - object ?v7 - type_2)
	      (pred_3 ?v1 - type_3 ?v8 - type_1)
	      (pred_1 ?v1 - type_3 ?v4 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v1 - type_3 ?v3 ?v5 - type_2)
       :precondition (and  (pred_4 ?v1 ?v3))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v3))))

   (:action op_3
       :parameters (?v1 - type_3 ?v6 - object ?v2 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v2) (pred_4 ?v1 ?v2) (pred_3 ?v1 ?v8))
       :effect (and (pred_1 ?v1 ?v6 ?v8)
		    (not (pred_2 ?v6 ?v2)) 
		    (not (pred_3 ?v1 ?v8))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v2 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v6 ?v8) (pred_4 ?v1 ?v2))
       :effect (and (pred_2 ?v6 ?v2)
		    (pred_3 ?v1 ?v8)
		    (not (pred_1 ?v1 ?v6 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_08 obj_09 - type_3
obj_02 obj_10 obj_05 obj_06 - type_1
obj_01 obj_04 obj_11 - type_2
obj_07 obj_03 - object)
(:init
(pred_4 obj_08 obj_01)
(pred_3 obj_08 obj_02)
(pred_3 obj_08 obj_10)
(pred_4 obj_09 obj_01)
(pred_3 obj_09 obj_05)
(pred_3 obj_09 obj_06)
(pred_2 obj_07 obj_04)
(pred_2 obj_03 obj_04)
)
(:goal
(and
(pred_2 obj_07 obj_11)
(pred_2 obj_03 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_08 obj_11)))
)
)

; plan
1. (op_2 obj_08 obj_01 obj_04)
   deleted: (pred_4 obj_08 obj_01)
   added: (pred_4 obj_08 obj_04)
   goals met: 0 of 2
2. (op_2 obj_09 obj_01 obj_11)
   deleted: (pred_4 obj_09 obj_01)
   added: (pred_4 obj_09 obj_11)
   goals met: 0 of 2
3. (op_3 obj_08 obj_03 obj_04 obj_10)
   deleted: (pred_2 obj_03 obj_04) (pred_3 obj_08 obj_10)
   added: (pred_1 obj_08 obj_03 obj_10)
   goals met: 0 of 2
4. (op_2 obj_09 obj_11 obj_04)
   deleted: (pred_4 obj_09 obj_11)
   added: (pred_4 obj_09 obj_04)
   goals met: 0 of 2
5. (op_3 obj_09 obj_07 obj_04 obj_06)
   deleted: (pred_2 obj_07 obj_04) (pred_3 obj_09 obj_06)
   added: (pred_1 obj_09 obj_07 obj_06)
   goals met: 0 of 2
6. (op_1 obj_08 obj_03 obj_04 obj_10)
   deleted: (pred_1 obj_08 obj_03 obj_10)
   added: (pred_2 obj_03 obj_04) (pred_3 obj_08 obj_10)
   goals met: 0 of 2
7. (op_2 obj_09 obj_04 obj_11)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_11)
   goals met: 0 of 2
8. (op_1 obj_09 obj_07 obj_11 obj_06)
   deleted: (pred_1 obj_09 obj_07 obj_06)
   added: (pred_2 obj_07 obj_11) (pred_3 obj_09 obj_06)
   goals met: 1 of 2
9. (op_2 obj_09 obj_11 obj_04)
   deleted: (pred_4 obj_09 obj_11)
   added: (pred_4 obj_09 obj_04)
   goals met: 1 of 2
10. (op_3 obj_09 obj_03 obj_04 obj_06)
   deleted: (pred_2 obj_03 obj_04) (pred_3 obj_09 obj_06)
   added: (pred_1 obj_09 obj_03 obj_06)
   goals met: 1 of 2
11. (op_2 obj_09 obj_04 obj_11)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_11)
   goals met: 1 of 2
12. (op_1 obj_09 obj_03 obj_11 obj_06)
   deleted: (pred_1 obj_09 obj_03 obj_06)
   added: (pred_2 obj_03 obj_11) (pred_3 obj_09 obj_06)
   goals met: 2 of 2
